## Plan Result (sbox-aks)




<pre><code>Plan: 12 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_resource_group.kubernetes_resource_group[1]
  * module.kubernetes[1].azapi_resource.service_operator_credential[0]
  * module.kubernetes[1].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[1].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[1].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]
  * module.kubernetes[1].azurerm_role_assignment.aks_auto_shutdown[0]
  * module.kubernetes[1].azurerm_role_assignment.genesis_managed_identity_operator[0]
  * module.kubernetes[1].azurerm_role_assignment.global_registry_acrpull[0]
  * module.kubernetes[1].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[1].azurerm_role_assignment.project_acrpull[0]
  * module.kubernetes[1].azurerm_role_assignment.uami_rg_identity_operator[0]
  * module.kubernetes[1].azurerm_role_assignment.update_checker[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.kubernetes_resource_group[1] will be created
  + resource "azurerm_resource_group" "kubernetes_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "cft-sbox-01-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # module.kubernetes[1].azapi_resource.service_operator_credential[0] will be created
  + resource "azapi_resource" "service_operator_credential" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "uksouth"
      + name                      = "cft-sbox-01-aks"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi"
      + schema_validation_enabled = false
      + tags                      = (known after apply)
      + type                      = "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials@2022-01-31-preview"
    }

  # module.kubernetes[1].azurerm_kubernetes_cluster.kubernetes_cluster will be created
  + resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      + automatic_channel_upgrade           = "patch"
      + dns_prefix                          = "k8s-cft-sbox-aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.25"
      + location                            = "uksouth"
      + name                                = "cft-sbox-01-aks"
      + node_resource_group                 = "cft-sbox-01-aks-node-rg"
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "cft-sbox-01-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Paid"
      + tags                                = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + workload_identity_enabled           = true

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = [
              + "a6ce5b32-e0a5-419e-ba5c-67863c975941",
              + (sensitive value),
            ]
          + azure_rbac_enabled     = false
          + managed                = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling          = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 4
          + max_pods                     = 30
          + min_count                    = 2
          + name                         = "system"
          + node_count                   = (known after apply)
          + node_labels                  = (known after apply)
          + only_critical_addons_enabled = true
          + orchestrator_version         = "1.25"
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Ephemeral"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + tags                         = {
              + "application"  = "core"
              + "autoShutdown" = "true"
              + "builtFrom"    = "hmcts/aks-cft-deploy"
              + "businessArea" = "CFT"
              + "criticality"  = "Low"
              + "environment"  = "sandbox"
              + "expiresAfter" = "3000-01-01"
            }
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_D4ds_v5"
          + vnet_subnet_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/aks-01"
          + workload_runtime             = (known after apply)
          + zones                        = [
              + "1",
            ]
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "5m"
        }

      + linux_profile {
          + admin_username = "k8sadmin"

          + ssh_key {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCeRwSzSKJfjmIVQ6CUld/M3vF9Hcfxh5cLBa1BV+UZDh5p1gKoB0xRegSFdncfup1qMAhrZtgBpaclLiYUfe8ZajPp1Lmva9AJuK/UktzF9stZie7LDpflEdVBXlSZw3AtAWxF2vIkEeW+NVYlGAJOQlasFkmGTkco+O1wUM4LGI3YNHm7r70rnmHT2djoR1t4x1jlPCrXaJEhvtyxf01Dwjq2nWaox3puJtHs5DLFpEIvXvHwQWssFFyKIuwkm4FewHKJSbCahyaCb+ac10MAZg9vZnWq0EYOe1nLn7c3538yJ9WJh7jRFZDza6ab9HVb5hgJ3/t/K+EzkU/XGSEJ"
            }
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)
        }
    }

  # module.kubernetes[1].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 10
      + max_pods              = 30
      + min_count             = 4
      + mode                  = "User"
      + name                  = "linux"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = []
      + orchestrator_version  = "1.25"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D4ds_v5"
      + vnet_subnet_id        = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/aks-01"
      + zones                 = [
          + "1",
        ]

      + timeouts {
          + update = "180m"
        }

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.kubernetes[1].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + name                       = "DiagLogAnalytics"
      + target_resource_id         = (known after apply)

      + log {
          + category = "cluster-autoscaler"
          + enabled  = true
        }
      + log {
          + category = "guard"
          + enabled  = true
        }
      + log {
          + category = "kube-apiserver"
          + enabled  = true
        }
      + log {
          + category = "kube-audit-admin"
          + enabled  = false
        }
      + log {
          + category = "kube-controller-manager"
          + enabled  = true
        }
      + log {
          + category = "kube-scheduler"
          + enabled  = true
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.kubernetes[1].azurerm_role_assignment.aks_auto_shutdown[0] will be created
  + resource "azurerm_role_assignment" "aks_auto_shutdown" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes[1].azurerm_role_assignment.genesis_managed_identity_operator[0] will be created
  + resource "azurerm_role_assignment" "genesis_managed_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes[1].azurerm_role_assignment.global_registry_acrpull[0] will be created
  + resource "azurerm_role_assignment" "global_registry_acrpull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes[1].azurerm_role_assignment.node_infrastructure_update_scale_set will be created
  + resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-aks-node-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes[1].azurerm_role_assignment.project_acrpull[0] will be created
  + resource "azurerm_role_assignment" "project_acrpull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes[1].azurerm_role_assignment.uami_rg_identity_operator[0] will be created
  + resource "azurerm_role_assignment" "uami_rg_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/managed-identities-sbox-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes[1].azurerm_role_assignment.update_checker[0] will be created
  + resource "azurerm_role_assignment" "update_checker" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "69c0f21d-e37c-41c2-8e16-b6873e941cea"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":409,"Program":"tfcmt","SHA1":"","Target":"sbox-aks","Vars":{}} -->